******************************************************************
      * IDENTIFICATION DIVISION: A carteira de identidade do programa.
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. OLA-MUNDO.
       AUTHOR. Luiz.

      ******************************************************************
      * PROCEDURE DIVISION: Onde a mágica acontece, os comandos.
      ******************************************************************
       PROCEDURE DIVISION.
       MAIN-ROUTINE.
           DISPLAY "Ola, mundo! Meu primeiro projeto em COBOL.".
           STOP RUN.